#include "buzzer.h"

/******************************************************************************/
/* 函数名称  : Buzzer      	  			      	  	      	               	  */
/* 函数描述  : 三次轮询，蜂鸣器响											  */	
/* 输入参数  : 无	                                                          */
/* 参数描述  : 无					                       		              */
/* 返回值    : 无			                                                  */
/******************************************************************************/
void Buzzer()
{
	unsigned char i;
	for(i = 0; i < 3; i++)
	{
		Hummer = LOW;
		Delay100ms();
		Hummer = HIGH;
		Delay100ms();
	}
}
