#include <reg52.h>
#include "OLED.h"
#include "LEDRGB.h"
#include "DELAY.h"
#include "SG90.h"
#include "HCSR04.h"
#include "SU03T.h"
#include "UART.h"
#include "TTLDefine.h"

/**************************位定义***********************************************/
sbit  D5 = P3^7;
sbit  D6 = P3^6;

/******************************************************************************/
/* 函数名称  : Indicator_Light                                                */
/* 函数描述  : 指示灯闪烁，表示MCU正常启动                                     */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无			                                                 */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Indicator_Light()
{
	unsigned char i;
	for(i=0;i<3;i++)
	{
		D5 = LOW;
		D6 = LOW;
		Delay1000ms();
		D5 = HIGH;
		D6 = HIGH;
		Delay1000ms();
	}
}

/******************************************************************************/
/* 函数名称  : main               		   	                                  */
/* 函数描述  : 入口函数                                                       */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无		                	                                  */
/* 返回值    : 无                                                            */
/******************************************************************************/
void main()
{
	Indicator_Light();//开机指示灯
	LED_Init();//避障LED灯              
	OLED_Show_Init();//OLED初始化信息
	Timer0_Init();//定时器0用于SG90舵机，定时500微秒
	Timer2_Init();//定时器2用于HCSR04超声波测距
	UART_Init();//串口初始化，用于蓝牙，WIFI，4G控制小车，使用定时器1
	SU03T_Init();//语音模块初始化
	SG90_Init();//舵机位置初始化
	HSCR04_Init();//初始化超声波距离和时间
	while(1)//调用语音模块
	{
		SU03T();
	}
}
